export const platData = [
    {
        "id": 67,
        "type": 1,
        "name": "周浦道路监控",
        "place": "周东南路33号",
        "geom": [
            {
                "lng": 121.58868670463562,
                "lat": 31.109287516510584
            },
            {
                "lng": 121.58950209617615,
                "lat": 31.10926914480733
            },
            {
                "lng": 121.5895289182663,
                "lat": 31.10882822286271
            },
            {
                "lng": 121.58875644207001,
                "lat": 31.10878229337573
            },
            {
                "lng": 121.58868670463562,
                "lat": 31.109287516510584
            }
        ],
        "contact": "",
        "contactPhone": "",
        "createTime": "2017-06-28 15:23:33",
        "updateTime": "2019-10-15 13:40:58"
    },
    {
        "id": 78,
        "type": 0,
        "name": "果园一二村",
        "place": "康沈路1938弄",
        "geom": [
            {
                "lng": 121.57840847969055,
                "lat": 31.10851130895027
            },
            {
                "lng": 121.57425105571747,
                "lat": 31.108382705901477
            },
            {
                "lng": 121.57426178455353,
                "lat": 31.109641171105423
            },
            {
                "lng": 121.57479286193848,
                "lat": 31.10962739237964
            },
            {
                "lng": 121.57477676868439,
                "lat": 31.110169354086374
            },
            {
                "lng": 121.57741606235504,
                "lat": 31.110242840181293
            },
            {
                "lng": 121.57750725746155,
                "lat": 31.1092737377335
            },
            {
                "lng": 121.57839775085449,
                "lat": 31.109370189131255
            },
            {
                "lng": 121.57844603061676,
                "lat": 31.10852508783801
            },
            {
                "lng": 121.57840847969055,
                "lat": 31.10851130895027
            }
        ],
        "contact": "",
        "contactPhone": "",
        "createTime": "2017-07-14 10:18:28",
        "updateTime": "2017-09-07 11:08:49"
    },
    {
        "id": 80,
        "type": 0,
        "name": "文馨苑",
        "place": "川周公路4293弄",
        "geom": [
            {
                "lng": 121.58055424690247,
                "lat": 31.12011701681389
            },
            {
                "lng": 121.58251762390137,
                "lat": 31.121816190127127
            },
            {
                "lng": 121.58278584480286,
                "lat": 31.121742712991573
            },
            {
                "lng": 121.58318281173706,
                "lat": 31.1195383724712
            },
            {
                "lng": 121.58125162124634,
                "lat": 31.119106683124137
            },
            {
                "lng": 121.58055424690247,
                "lat": 31.12011701681389
            }
        ],
        "contact": "",
        "contactPhone": "",
        "createTime": "2017-07-14 17:02:18",
        "updateTime": null
    },
    {
        "id": 81,
        "type": 0,
        "name": "泰苑小区",
        "place": "上南路7992弄",
        "geom": [
            {
                "lng": 121.57400965690613,
                "lat": 31.118619882143207
            },
            {
                "lng": 121.57435297966003,
                "lat": 31.117301832992986
            },
            {
                "lng": 121.57553851604462,
                "lat": 31.117586569899416
            },
            {
                "lng": 121.57522737979889,
                "lat": 31.1186520294548
            },
            {
                "lng": 121.57499670982361,
                "lat": 31.118950539685265
            },
            {
                "lng": 121.57400965690613,
                "lat": 31.118619882143207
            }
        ],
        "contact": "",
        "contactPhone": "",
        "createTime": "2017-07-14 17:08:42",
        "updateTime": "2017-09-07 11:08:51"
    },
    {
        "id": 82,
        "type": 0,
        "name": "公元新村",
        "place": "康沈路1445弄",
        "geom": [
            {
                "lng": 121.5753722190857,
                "lat": 31.12225705174571
            },
            {
                "lng": 121.57713174819946,
                "lat": 31.122275420935356
            },
            {
                "lng": 121.57747507095337,
                "lat": 31.122174390348224
            },
            {
                "lng": 121.57770037651062,
                "lat": 31.12099875379006
            },
            {
                "lng": 121.57701373100281,
                "lat": 31.120796689789934
            },
            {
                "lng": 121.57546877861023,
                "lat": 31.12071402712041
            },
            {
                "lng": 121.5753722190857,
                "lat": 31.12225705174571
            }
        ],
        "contact": "",
        "contactPhone": "",
        "createTime": "2017-07-14 17:10:53",
        "updateTime": null
    },
    {
        "id": 91,
        "type": 0,
        "name": "汇华花园",
        "place": "年家浜路428弄",
        "geom": [
            {
                "lng": 121.57306551933289,
                "lat": 31.115313243364913
            },
            {
                "lng": 121.57322645187378,
                "lat": 31.114293673173815
            },
            {
                "lng": 121.5739506483078,
                "lat": 31.11443604624573
            },
            {
                "lng": 121.57378435134888,
                "lat": 31.11538213284773
            },
            {
                "lng": 121.57306551933289,
                "lat": 31.115313243364913
            }
        ],
        "contact": "",
        "contactPhone": "",
        "createTime": "2017-07-14 18:01:37",
        "updateTime": null
    },
    {
        "id": 92,
        "type": 0,
        "name": "欣周公寓",
        "place": "年家浜路366弄",
        "geom": [
            {
                "lng": 121.57553315162659,
                "lat": 31.115763320415578
            },
            {
                "lng": 121.57568335533142,
                "lat": 31.114697828433552
            },
            {
                "lng": 121.57680988311768,
                "lat": 31.11495042459706
            },
            {
                "lng": 121.5765631198883,
                "lat": 31.115896506072385
            },
            {
                "lng": 121.57553315162659,
                "lat": 31.115763320415578
            }
        ],
        "contact": "",
        "contactPhone": "",
        "createTime": "2017-07-14 18:04:44",
        "updateTime": null
    },
    {
        "id": 93,
        "type": 0,
        "name": "永恒公寓",
        "place": "上南路7788弄",
        "geom": [
            {
                "lng": 121.5702223777771,
                "lat": 31.11782997335193
            },
            {
                "lng": 121.57081246376038,
                "lat": 31.116415469090338
            },
            {
                "lng": 121.57261490821838,
                "lat": 31.11674613431211
            },
            {
                "lng": 121.57197117805481,
                "lat": 31.118371888230676
            },
            {
                "lng": 121.57196044921875,
                "lat": 31.118179003628477
            },
            {
                "lng": 121.5702223777771,
                "lat": 31.11782997335193
            }
        ],
        "contact": "",
        "contactPhone": "",
        "createTime": "2017-07-15 08:46:40",
        "updateTime": null
    },
    {
        "id": 94,
        "type": 0,
        "name": "康健小区",
        "place": "康沈路1802弄",
        "geom": [
            {
                "lng": 121.57434225082397,
                "lat": 31.11714568658484
            },
            {
                "lng": 121.57453536987305,
                "lat": 31.11674154174748
            },
            {
                "lng": 121.57498061656952,
                "lat": 31.116828800437577
            },
            {
                "lng": 121.5747982263565,
                "lat": 31.117283462840646
            },
            {
                "lng": 121.57434225082397,
                "lat": 31.11714568658484
            }
        ],
        "contact": "",
        "contactPhone": "",
        "createTime": "2017-07-15 08:54:36",
        "updateTime": null
    },
    {
        "id": 96,
        "type": 0,
        "name": "公元三邨",
        "place": "康沈路1502弄",
        "geom": [
            {
                "lng": 121.57404720783234,
                "lat": 31.120406337662214
            },
            {
                "lng": 121.57427251338959,
                "lat": 31.119855249572055
            },
            {
                "lng": 121.57462120056152,
                "lat": 31.119896581289822
            },
            {
                "lng": 121.57465875148773,
                "lat": 31.119005649163636
            },
            {
                "lng": 121.57535076141357,
                "lat": 31.119262826306127
            },
            {
                "lng": 121.57529175281525,
                "lat": 31.120599217737748
            },
            {
                "lng": 121.57404720783234,
                "lat": 31.120406337662214
            }
        ],
        "contact": "",
        "contactPhone": "",
        "createTime": "2017-07-15 09:04:21",
        "updateTime": "2017-09-17 13:34:41"
    }
]
export const camsdata = [{
    "id": 10734,
    "channelNum": 1,
    "type": 0,
    "ascriptionType": 1,
    "ip": "172.16.251.239",
    "port": 554,
    "username": "admin",
    "password": "a1234567",
    "geom": null,
    "url": "rtsp://admin:admin12345@172.16.253.50:554/Streaming/Channels/0101",
    "status": 0,
    "createTime": "2018-08-30 13:01:59",
    "updateTime": "2018-09-03 09:46:29",
    "cameraId": 886, "geomType": 1,
    "center": { "lng": 121.64692282676697, "lat": 31.107243642722715 },
    "radius": 50, "direction": null, "dahuaCamId": null, "name": "周祝/1356号飞帆饲料西侧"
}, {
    "id": 10735, "channelNum": 2, "type": 0, "ascriptionType": 1,
    "ip": "172.16.251.240", "port": 554, "username": "admin", "password": "a1234567", "geom": null, "url": "rtsp://admin:admin12345@172.16.253.50:554/Streaming/Channels/0201", "status": 0, "createTime": "2018-08-30 13:05:44", "updateTime": null, "cameraId": 886, "geomType": 1, "center": { "lng": 121.65559709072113, "lat": 31.107528409798462 }, "radius": 50, "direction": null, "dahuaCamId": null, "name": "周祝/顾永洋寓所西侧"
}, { "id": 10736, "channelNum": 3, "type": 0, "ascriptionType": 1, "ip": "172.16.251.241", "port": 554, "username": "admin", "password": "a1234567", "geom": null, "url": "rtsp://admin:admin12345@172.16.253.50:554/Streaming/Channels/0301", "status": 0, "createTime": "2018-08-30 13:08:29", "updateTime": null, "cameraId": 886, "geomType": 1, "center": { "lng": 121.65014684200287, "lat": 31.09319713588988 }, "radius": 50, "direction": null, "dahuaCamId": null, "name": "陆陆路/陆北路" }, { "id": 10737, "channelNum": 4, "type": 0, "ascriptionType": 1, "ip": "172.16.251.242", "port": 554, "username": "admin", "password": "a1234567", "geom": null, "url": "rtsp://admin:admin12345@172.16.253.50:554/Streaming/Channels/0401", "status": 0, "createTime": "2018-08-30 13:10:46", "updateTime": null, "cameraId": 886, "geomType": 1, "center": { "lng": 121.64558172225952, "lat": 31.09128154219809 }, "radius": 50, "direction": null, "dahuaCamId": null, "name": "申江/傅家宅路" }, {
    "id": 10738, "channelNum": 5, "type": 0, "ascriptionType": 1, "ip": "172.16.251.243", "port": 554, "username": "admin", "password": "a1234567", "geom": null, "url": "rtsp://admin:admin12345@172.16.253.50:554/Streaming/Channels/0501", "status": 0, "createTime": "2018-08-30 13:13:30", "updateTime": null, "cameraId": 886, "geomType": 1,
    "center": { "lng": 121.64983570575714, "lat": 31.097919345772848 },
    "radius": 50, "direction": null, "dahuaCamId": null, "name": "陆陆路/陆瓦路"
}]
